greghulette/Arduino-Code/Body_Controller/Body_Controller_ATMEGA2560/body_controller_atmega2560_pin_map.h
#ifndef body_controller_atmega2560_pin_map.h
#define body_controller_atmega2560_pin_map.h

////////////////////////////////
// Body LED Controller Pinout
// ------------------
// This pinout is for a ATMEGA2560
////////////////////////////////

#define SPECTRUM_RIGHT_PIN  0   // W // Unused Pin
#define SPECTRUM_LEFT_PIN   1   // N // Unused Pin
#define A2				    2   // Y // Unused Pin
#define EXTERNAL_MIC_PIN    3   // N // high at boot
#define A4        		    4   // Y // Unused Pin
#define A5				    5   // Y // Unused Pin 
#define A6                  6   // N // Unused Pin
#define VOLTAGE_SENSOR_PIN  7   // N // Unused Pin
#define A8                  8   // N // Unused Pin
#define A9                  9   // N // Unused Pin
#define A10                 10 // N // Unused Pin
#define A11                 11 //  N // Unused Pin
#define A12				    12 // W // Unused Pin 
#define A13                 13 // Y // Unused Pin
#define A14                 14 // Y // Unused Pin
#define A15       		    15 // Y // Unused Pin 
#define D1                  1 // Y // Unused Pin
#define D2                  2 // Y // Unused Pin
#define DATAIN_PIN	        3 // Y // Unused Pin
#define CLOCK_PIN           4 // Y // Unused Pin
#define LOAD_PIN            5 // N // TUnused Pin
#define D6                  6 // Y // Unused Pin
#define D7                  7 // Y // Unused Pin
#define D8	                8 // Y // Unused Pin 
#define D9                  9 // N // Unused Pin
#define D10                 10 // Y // Unused Pin
#define D11                 11 // Y // Unused Pin
#define VU_STROBE           12 // Y // Unused Pin
#define VU_RESET	        13 // Y // Unused Pin
#define D14                 14 // Y // Unused Pin
#define D15                 15 // N // TUnused Pin
#define D16                 16 // Y // Unused Pin
#define D17                 17 // Y // Unused Pin
#define D18	                18 // Y // Unused Pin 
#define D19                 19 // N // Unused Pin
#define D20                 20 // Y // Unused Pin
#define D21                 21 // Y // Unused Pin
#define D22                 22// Y // Unused Pin
#define D23	                23 // Y // Unused Pin
#define D24                 24 // Y // Unused Pin
#define D25                 25 // N // TUnused Pin
#define D26                 26 // Y // Unused Pin
#define D27                 27 // Y // Unused Pin
#define D28	                28 // Y // Unused Pin 
#define D29                 29 // N // Unused Pin
#define MAINT_DATA_PIN      30 // Y // Unused Pin
#define D31                 31 // Y // Unused Pin
#define MAINT_CLOCK_PIN     32 // Y // Unused Pin
#define D33	                33 // Y // Unused Pin
#define LDP_DATA_PIN        34 // Y // Unused Pin
#define D35                 35 // N // TUnused Pin
#define LDP_CLOCK_PIN       36 // Y // Unused Pin
#define D37                 37 // Y // Unused Pin
#define CS1_DATA_PIN	    38 // Y // Unused Pin 
#define D39                 39 // N // Unused Pin
#define CS1_CLOCK_PIN       40 // Y // Unused Pin
#define D41                 41 // Y // Unused Pin
#define CS2_DATA_PIN        42 // Y // Unused Pin
#define D43	                43 // Y // Unused Pin
#define CS2_CLOCK_PIN       44 // Y // Unused Pin
#define D45                 45 // N // TUnused Pin
#define VU1_DATA_PIN        46 // Y // Unused Pin
#define D47                 47 // Y // Unused Pin
#define VU1_CLOCK_PIN	    48 // Y // Unused Pin 
#define RED_LED             49 // N // Unused Pin
#define VU2_DATA_PIN        50 // Y // Unused Pin
#define YELLOW_LED	        51 // Y //  Unused Pin
#define VU2_CLOCK_PIN       52 // N // Unused Pin
#define GREEN_LED           53 // Y // Unused Pin

#endif
